In [4]:
import pandas as pd
titanic = pd.read_csv("file:/C:/Users/SHUBHAM/DataSet_1/Titanic/train.csv")

In [5]:
titanic['Age'].mode()

0    24.0
Name: Age, dtype: float64

In [6]:
ls = [2,13,4,54,5]
d = pd.DataFrame({"m":ls})

In [7]:
d

    m
0   2
1  13
2   4
3  54
4   5

In [8]:
import numpy as np
import pandas as pd

df = pd.DataFrame([('bird', 2, 2),
                   ('mammal', 4, np.nan),
                   ('arthropod', 8, 0),
                   ('bird', 2, np.nan)],
                  index=('eagle', 'tiger', 'spider', 'duck'),
                  columns=('species', 'legs', 'wings'))
df

          species  legs  wings
eagle        bird     2    2.0
tiger      mammal     4    NaN
spider  arthropod     8    0.0
duck         bird     2    NaN

In [9]:
df.mode()

  species  legs  wings
0    bird   2.0    0.0
1     NaN   NaN    2.0

In [10]:
# importing pandas as pd
import pandas as pd

# Creating the dataframe
df=pd.DataFrame({"A":[14,4,5,4,1],
                 "B":[5,2,54,3,2],
                 "C":[20,20,7,3,8],
                 "D":[14,3,6,2,6]})

# Print the dataframe
# df['B'] = df['B'].replace(to_replace=[2,3], value = 20)
df['B'] = df['B'].replace([2,3],23)
df

    A   B   C   D
0  14   5  20  14
1   4  23  20   3
2   5  54   7   6
3   4  23   3   2
4   1  23   8   6

In [11]:
df['B'].median()

23.0

In [ ]:
import pandas as pd
import numpy as np
from scipy import stats
 
#Create a DataFrame
d = {
    'Name':['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine',
   'Rahul','David','Andrew','Ajay','Teresa'],
   'Score1':[62,47,55,74,31,77,85,63,42,32,71,57],
   'Score2':[89,87,67,55,47,72,76,79,44,92,99,69]}
 
 
df = pd.DataFrame(d)
scipy.stats.hmean(df['Score1'])

In [17]:
# Harmonic Mean of the  column in dataframe
from scipy import stats

 
stats.hmean(df.iloc[:,1:3],axis=0)

array([52.4769906 , 68.56766396])

In [18]:
import numpy as np

ar = np.array([2,2,3,4])

np.mean(ar)

2.75

In [19]:
np.std(ar)

0.82915619758885

In [20]:
np.median(ar)

2.5

In [27]:
import statistics as s


np.std(np.array([2,3]))

0.5

In [29]:
import statistics as stat

d1 = [1,2,3,4,5,7]
d2 = [1,2,3,4,5,7]
stat.median(d2)
stat.median_low(d1)
stat.median_high(d2)
stat.median_grouped(d1)

3.5

In [30]:
stat.harmonic_mean([40, 60])

48.0

In [31]:
stat.geometric_mean([3,3,3])

3.0000000000000004

In [32]:
stat.fmean([3.5, 4.0, 5.25])

4.25

In [33]:
d1 = [1,2,4,2,4,2,8,6,4,2,3,8]
d2 = ["red", "blue", "blue", "red", "green", "red", "red"]
stat.mode(d1)
stat.mode(d2)
stat.multimode('aaabbbbnnnn')

['b', 'n']

In [34]:
stat.multimode('aabbbbccddddeeffffgg')

['b', 'd', 'f']

In [35]:
stat.pstdev([1.5, 2.5, 2.5, 2.75, 3.25, 4.75])

0.986893273527251

In [36]:
data = [1,9]
m = stat.mean(data)
stat.variance(data, m)

32

In [37]:
student = [
    {'name':'Krishna','age':12,'marks':56},
    {'name':'Rakesh','age':19,'marks':6},
    {'name':'Ankush','age':14,'marks':24},
    {'name':'Rakesh','age':34,'marks':83},
]

In [39]:
ls = [23,54,6,7,12]

def add(element):
    return element+10

new_list = map(add,ls)
type(new_list)
list(new_list)

[33, 64, 16, 17, 22]

In [40]:
student = [
    {'name':'Krishna','age':12,'marks':56},
    {'name':'Rakesh','age':19,'marks':6},
    {'name':'Ankush','age':14,'marks':24},
    {'name':'Rakesh','age':34,'marks':83},
]

In [41]:
def addResult(element):
    if element['marks']>= 35:
        element['result'] = 'pass'
    else:
        element['result'] = 'fail'
    return element

In [42]:
new_Stu = map(addResult,student)
list(new_Stu)

[{'name': 'Krishna', 'age': 12, 'marks': 56, 'result': 'pass'},
 {'name': 'Rakesh', 'age': 19, 'marks': 6, 'result': 'fail'},
 {'name': 'Ankush', 'age': 14, 'marks': 24, 'result': 'fail'},
 {'name': 'Rakesh', 'age': 34, 'marks': 83, 'result': 'pass'}]

In [43]:
d = {'a':'java','fee':890}
print(d)

{'a': 'java', 'fee': 890}

In [44]:
d['duration'] = '4 months'
print(d)

{'a': 'java', 'fee': 890, 'duration': '4 months'}

In [45]:
ls = [13,3,43,6,7,12,7,15,12,4]

def findEven(element):
    return element % 2 == 0
       
    
evenList = filter(findEven,ls)
list(evenList)

[6, 12, 12, 4]

In [46]:
student = [
    {'name':'Krishna','age':12,'marks':56},
    {'name':'Rakesh','age':19,'marks':6},
    {'name':'Ankush','age':14,'marks':24},
    {'name':'Rakesh','age':34,'marks':83},
]

In [47]:
def findStu(element):
    return element['age']>=18

eligible_stu = filter(findStu,student)
list(eligible_stu)

[{'name': 'Rakesh', 'age': 19, 'marks': 6},
 {'name': 'Rakesh', 'age': 34, 'marks': 83}]

In [48]:
import numpy as np
import statistics as stat

ar = np.array([9,3,6,5,4])

print(stat.fmean(ar))

5.4

In [49]:
stat.mode(ar)

9

In [50]:
# 2 4 5 6 9
ar = np.array([2,4, 5,6,9,10])
stat.median(ar)

5.5